Tekla Open API Reference for Tekla Structures 2025
AnalysisDesignSettings Constructor
 Creates a new analysis design settings instance.
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public AnalysisDesignSettings()
Public Sub New
See Also
Reference
AnalysisDesignSettings Class
Tekla.Structures.Analysis Namespace